JMA_ICON_BASEURL = 'https://www.jma.go.jp/bosai/forecast/img/'

JMA_ICONS = {
    '100': {
        'day': '100.svg',
        'night': '500.svg'
    },
    '101': {
        'day': '101.svg',
        'night': '501.svg'
    },
    '102': {
        'day': '102.svg',
        'night': '502.svg'
    },
    '103': {
        'day': '102.svg',
        'night': '502.svg'
    },
    '104': {
        'day': '104.svg',
        'night': '504.svg'
    },
    '105': {
        'day': '104.svg',
        'night': '504.svg'
    },
    '106': {
        'day': '102.svg',
        'night': '502.svg'
    },
    '107': {
        'day': '102.svg',
        'night': '502.svg'
    },
    '108': {
        'day': '102.svg',
        'night': '502.svg'
    },
    '110': {
        'day': '110.svg',
        'night': '510.svg'
    },
    '111': {
        'day': '110.svg',
        'night': '510.svg'
    },
    '112': {
        'day': '112.svg',
        'night': '512.svg'
    },
    '113': {
        'day': '112.svg',
        'night': '512.svg'
    },
    '114': {
        'day': '112.svg',
        'night': '512.svg'
    },
    '115': {
        'day': '115.svg',
        'night': '515.svg'
    },
    '116': {
        'day': '115.svg',
        'night': '515.svg'
    },
    '117': {
        'day': '115.svg',
        'night': '515.svg'
    },
    '118': {
        'day': '112.svg',
        'night': '512.svg'
    },
    '119': {
        'day': '112.svg',
        'night': '512.svg'
    },
    '120': {
        'day': '102.svg',
        'night': '502.svg'
    },
    '121': {
        'day': '102.svg',
        'night': '502.svg'
    },
    '122': {
        'day': '112.svg',
        'night': '512.svg'
    },
    '123': {
        'day': '100.svg',
        'night': '500.svg'
    },
    '124': {
        'day': '100.svg',
        'night': '500.svg'
    },
    '125': {
        'day': '112.svg',
        'night': '512.svg'
    },
    '126': {
        'day': '112.svg',
        'night': '512.svg'
    },
    '127': {
        'day': '112.svg',
        'night': '512.svg'
    },
    '128': {
        'day': '112.svg',
        'night': '512.svg'
    },
    '130': {
        'day': '100.svg',
        'night': '500.svg'
    },
    '131': {
        'day': '100.svg',
        'night': '500.svg'
    },
    '132': {
        'day': '101.svg',
        'night': '501.svg'
    },
    '140': {
        'day': '102.svg',
        'night': '502.svg'
    },
    '160': {
        'day': '104.svg',
        'night': '504.svg'
    },
    '170': {
        'day': '104.svg',
        'night': '504.svg'
    },
    '181': {
        'day': '115.svg',
        'night': '515.svg'
    },
    '200': {
        'day': '200.svg',
        'night': '200.svg'
    },
    '201': {
        'day': '201.svg',
        'night': '601.svg'
    },
    '202': {
        'day': '202.svg',
        'night': '202.svg'
    },
    '203': {
        'day': '202.svg',
        'night': '202.svg'
    },
    '204': {
        'day': '204.svg',
        'night': '204.svg'
    },
    '205': {
        'day': '204.svg',
        'night': '204.svg'
    },
    '206': {
        'day': '202.svg',
        'night': '202.svg'
    },
    '207': {
        'day': '202.svg',
        'night': '202.svg'
    },
    '208': {
        'day': '202.svg',
        'night': '202.svg'
    },
    '209': {
        'day': '200.svg',
        'night': '200.svg'
    },
    '210': {
        'day': '210.svg',
        'night': '610.svg'
    },
    '211': {
        'day': '210.svg',
        'night': '610.svg'
    },
    '212': {
        'day': '212.svg',
        'night': '212.svg'
    },
    '213': {
        'day': '212.svg',
        'night': '212.svg'
    },
    '214': {
        'day': '212.svg',
        'night': '212.svg'
    },
    '215': {
        'day': '215.svg',
        'night': '215.svg'
    },
    '216': {
        'day': '215.svg',
        'night': '215.svg'
    },
    '217': {
        'day': '215.svg',
        'night': '215.svg'
    },
    '218': {
        'day': '212.svg',
        'night': '212.svg'
    },
    '219': {
        'day': '212.svg',
        'night': '212.svg'
    },
    '220': {
        'day': '202.svg',
        'night': '202.svg'
    },
    '221': {
        'day': '202.svg',
        'night': '202.svg'
    },
    '222': {
        'day': '212.svg',
        'night': '212.svg'
    },
    '223': {
        'day': '201.svg',
        'night': '601.svg'
    },
    '224': {
        'day': '212.svg',
        'night': '212.svg'
    },
    '225': {
        'day': '212.svg',
        'night': '212.svg'
    },
    '226': {
        'day': '212.svg',
        'night': '212.svg'
    },
    '228': {
        'day': '215.svg',
        'night': '215.svg'
    },
    '229': {
        'day': '215.svg',
        'night': '215.svg'
    },
    '230': {
        'day': '215.svg',
        'night': '215.svg'
    },
    '231': {
        'day': '200.svg',
        'night': '200.svg'
    },
    '240': {
        'day': '202.svg',
        'night': '202.svg'
    },
    '250': {
        'day': '204.svg',
        'night': '204.svg'
    },
    '260': {
        'day': '204.svg',
        'night': '204.svg'
    },
    '270': {
        'day': '204.svg',
        'night': '204.svg'
    },
    '281': {
        'day': '215.svg',
        'night': '215.svg'
    },
    '300': {
        'day': '300.svg',
        'night': '300.svg'
    },
    '301': {
        'day': '301.svg',
        'night': '701.svg'
    },
    '302': {
        'day': '302.svg',
        'night': '302.svg'
    },
    '303': {
        'day': '303.svg',
        'night': '303.svg'
    },
    '304': {
        'day': '300.svg',
        'night': '300.svg'
    },
    '306': {
        'day': '300.svg',
        'night': '300.svg'
    },
    '308': {
        'day': '308.svg',
        'night': '308.svg'
    },
    '309': {
        'day': '303.svg',
        'night': '303.svg'
    },
    '311': {
        'day': '311.svg',
        'night': '711.svg'
    },
    '313': {
        'day': '313.svg',
        'night': '313.svg'
    },
    '314': {
        'day': '314.svg',
        'night': '314.svg'
    },
    '315': {
        'day': '314.svg',
        'night': '314.svg'
    },
    '316': {
        'day': '311.svg',
        'night': '711.svg'
    },
    '317': {
        'day': '313.svg',
        'night': '313.svg'
    },
    '320': {
        'day': '311.svg',
        'night': '711.svg'
    },
    '321': {
        'day': '313.svg',
        'night': '313.svg'
    },
    '322': {
        'day': '303.svg',
        'night': '303.svg'
    },
    '323': {
        'day': '311.svg',
        'night': '711.svg'
    },
    '324': {
        'day': '311.svg',
        'night': '711.svg'
    },
    '325': {
        'day': '311.svg',
        'night': '711.svg'
    },
    '326': {
        'day': '314.svg',
        'night': '314.svg'
    },
    '327': {
        'day': '314.svg',
        'night': '314.svg'
    },
    '328': {
        'day': '300.svg',
        'night': '300.svg'
    },
    '329': {
        'day': '300.svg',
        'night': '300.svg'
    },
    '340': {
        'day': '400.svg',
        'night': '400.svg'
    },
    '350': {
        'day': '300.svg',
        'night': '300.svg'
    },
    '361': {
        'day': '411.svg',
        'night': '811.svg'
    },
    '371': {
        'day': '413.svg',
        'night': '413.svg'
    },
    '400': {
        'day': '400.svg',
        'night': '400.svg'
    },
    '401': {
        'day': '401.svg',
        'night': '801.svg'
    },
    '402': {
        'day': '402.svg',
        'night': '402.svg'
    },
    '403': {
        'day': '403.svg',
        'night': '403.svg'
    },
    '405': {
        'day': '400.svg',
        'night': '400.svg'
    },
    '406': {
        'day': '406.svg',
        'night': '406.svg'
    },
    '407': {
        'day': '406.svg',
        'night': '406.svg'
    },
    '409': {
        'day': '403.svg',
        'night': '403.svg'
    },
    '411': {
        'day': '411.svg',
        'night': '811.svg'
    },
    '413': {
        'day': '413.svg',
        'night': '413.svg'
    },
    '414': {
        'day': '414.svg',
        'night': '414.svg'
    },
    '420': {
        'day': '411.svg',
        'night': '811.svg'
    },
    '421': {
        'day': '413.svg',
        'night': '413.svg'
    },
    '422': {
        'day': '414.svg',
        'night': '414.svg'
    },
    '423': {
        'day': '414.svg',
        'night': '414.svg'
    },
    '425': {
        'day': '400.svg',
        'night': '400.svg'
    },
    '426': {
        'day': '400.svg',
        'night': '400.svg'
    },
    '427': {
        'day': '400.svg',
        'night': '400.svg'
    },
    '450': {
        'day': '400.svg',
        'night': '400.svg',
    }
}


JMA_TELOPS = {
    '100' : '晴れ',
    '101' : '晴時々曇',
    '102' : '晴一時雨',
    '103' : '晴時々雨',
    '104' : '晴一時雪',
    '105' : '晴時々雪',
    '106' : '晴一時雨か雪',
    '107' : '晴時々雨か雪',
    '108' : '晴一時雨か雷雨',
    '110' : '晴のち時々曇',
    '111' : '晴のち曇',
    '112' : '晴のち一時雨',
    '113' : '晴のち時々雨',
    '114' : '晴のち雨',
    '115' : '晴のち一時雪',
    '116' : '晴のち時々雪',
    '117' : '晴のち雪',
    '118' : '晴のち雨か雪',
    '119' : '晴のち雨か雷雨',
    '120' : '晴朝夕一時雨',
    '121' : '晴朝の内一時雨',
    '122' : '晴夕方一時雨',
    '123' : '晴山沿い雷雨',
    '124' : '晴山沿い雪',
    '125' : '晴午のちは雷雨',
    '126' : '晴昼頃から雨',
    '127' : '晴夕方から雨',
    '128' : '晴夜は雨',
    '130' : '朝の内霧のち晴',
    '131' : '晴明け方霧',
    '132' : '晴朝夕曇',
    '140' : '晴時々雨で雷を伴う',
    '160' : '晴一時雪か雨',
    '170' : '晴時々雪か雨',
    '181' : '晴のち雪か雨',
    '200' : '曇り',
    '201' : '曇時々晴',
    '202' : '曇一時雨',
    '203' : '曇時々雨',
    '204' : '曇一時雪',
    '205' : '曇時々雪',
    '206' : '曇一時雨か雪',
    '207' : '曇時々雨か雪',
    '208' : '曇一時雨か雷雨',
    '209' : '霧',
    '210' : '曇のち時々晴',
    '211' : '曇のち晴',
    '212' : '曇のち一時雨',
    '213' : '曇のち時々雨',
    '214' : '曇のち雨',
    '215' : '曇のち一時雪',
    '216' : '曇のち時々雪',
    '217' : '曇のち雪',
    '218' : '曇のち雨か雪',
    '219' : '曇のち雨か雷雨',
    '220' : '曇朝夕一時雨',
    '221' : '曇朝の内一時雨',
    '222' : '曇夕方一時雨',
    '223' : '曇日中時々晴',
    '224' : '曇昼頃から雨',
    '225' : '曇夕方から雨',
    '226' : '曇夜は雨',
    '228' : '曇昼頃から雪',
    '229' : '曇夕方から雪',
    '230' : '曇夜は雪',
    '231' : '曇海上海岸は霧か霧雨',
    '240' : '曇時々雨で雷を伴う',
    '250' : '曇時々雪で雷を伴う',
    '260' : '曇一時雪か雨',
    '270' : '曇時々雪か雨',
    '281' : '曇のち雪か雨',
    '300' : '雨',
    '301' : '雨時々晴',
    '302' : '雨時々止む',
    '303' : '雨時々雪',
    '304' : '雨か雪',
    '306' : '大雨',
    '308' : '暴風雨',
    '309' : '雨一時雪',
    '311' : '雨のち晴',
    '313' : '雨のち曇',
    '314' : '雨のち時々雪',
    '315' : '雨のち雪',
    '316' : '雨か雪のち晴',
    '317' : '雨か雪のち曇',
    '320' : '朝の内雨のち晴',
    '321' : '朝の内雨のち曇',
    '322' : '雨朝晩一時雪',
    '323' : '雨昼頃から晴',
    '324' : '雨夕方から晴',
    '325' : '雨夜は晴',
    '326' : '雨夕方から雪',
    '327' : '雨夜は雪',
    '328' : '雨一時強く降る',
    '329' : '雨一時みぞれ',
    '340' : '雪か雨',
    '350' : '雨で雷を伴う',
    '361' : '雪か雨のち晴',
    '371' : '雪か雨のち曇',
    '400' : '雪',
    '401' : '雪時々晴',
    '402' : '雪時々止む',
    '403' : '雪時々雨',
    '405' : '大雪',
    '406' : '風雪強い',
    '407' : '暴風雪',
    '409' : '雪一時雨',
    '411' : '雪のち晴',
    '413' : '雪のち曇',
    '414' : '雪のち雨',
    '420' : '朝の内雪のち晴',
    '421' : '朝の内雪のち曇',
    '422' : '雪昼頃から雨',
    '423' : '雪夕方から雨',
    '425' : '雪一時強く降る',
    '426' : '雪のちみぞれ',
    '427' : '雪一時みぞれ',
    '450' : '雪で雷を伴う',
}
